package COM.ex0427.pm;

public class Ex01 {
	/*
	 *  운영체제
	 *  운영체제는 하드웨어와 응용프로그램간의 인터페이스 역할을 담당
	 *  
	 *  
	 *  물리적인 자원들의 관리를 하기 위한 시스템
	 *  
	 *  중앙처리장치, 주기억장치, 입출력장치등의 컴퓨터 자원을 관리한다.
	 *  
	 *  운영체제는 인간과 컴퓨터간의 상호작용을 제공함과 동시에 컴퓨터의 동작을 구동하고 작업의 순서를 정하며 입출력 연산을 제어한다.
	 *  
	 *  프로그램의 오류나 부적절한 사용을 방지하기 위해 실행을 제어하며 데이터를 파일에 저장하는 등 장치를 관리하는 기능을 한다.
	 *  
	 *  운영체제의 역할은 메모리관리, 프로세스 관리, 장치 및 파일관리의 세가지로 볼 수 있다!!!!.
	 *  
	 */

		/*
		 * 윈도우
		 * 마이크로 소프트 사에서 개발한 컴퓨터 운영체제
		 * 
		 * 가장 높은 점유율을 가지며  가정용 퍼스널 컴퓨터에 가장 많이 탑재 되는 OS
		 * 
		 * GUI를 메인으로 지원하며 사용자들이 가장 많이 쓰는 인터페이스를 제공하기도 함.
		 * 
		 * 상용 소프트웨어 이며 라이센스를 통한 관리를 위해 최근 보안이 강화되어 OS가 개발됨
		 * 
		 * 
		 */
	/*
	 * Linux OS
	 * 리누스 토발즈를 시점으로 만들어진 가정용 최초의 OS
	 * 
	 * 리누스가 처음 개발한 커널을 오픈 소스화 하면서 리눅스OS에 대한 오픈소스 개발이 활발해지기 시작
	 * 
	 * 최근에는 많은 리눅스 제품들이 나오고 있으며 원래는 CUI(console user interface)를 지향했지만 시간이 지나면서 GUI환경들을 지원하기 시작
	 * 
	 * 몇몇 제품들은 상용화를 하여 일부 제품들 중에서는 라이센스 비용을 지불하고 써야하는 OS가 존재한다.
	 */

	/*
	 * MAC OS
	 * 애플사에서 Linux 커널을 바탕으로 직접 제작한 OS
	 * 
	 * 2002년 4월 부터 모든 매킨토시 컴퓨터에 탑제되기 시작
	 * 
	 * 이 운영체제는 애플이 1996년 12월에 인수한 NeXt의 기술력으로 만들어졌으며 최근 버전업을 통해 맥Pro등 다양한 디바이스에 탑재되고 있다.
	 * 
	 * 
	 * 
	 */
}
