package COM.ex0418.am;

public class SampleClass {
	
	/*
	 * camel case 사용법
	 * 클래스명: 첫글자는 대문자. 단어가 끝날때까지 첫글자를 제외한 나머지는 소문자. 다음글자가 시작할때 해당 글자의 첫글자는 대문자, 뒤에 이어지는 글자는 소문자, 명사형으로 시작
	 * 필드: 첫 글자는 소문자 . 단어가 끝날떄까지 첫 글자를 제외한 나머지는 소문자. 다음글자가 시작할때 해당 글자의 첫글자는 대문자, 뒤에 이어지는 글자는 소문자, 명사형으로 시작
	 * 메서드 : 첫 글자는 소문자 . 단어가 끝날떄까지 첫 글자를 제외한 나머지는 소문자. 다음글자가 시작할때 해당 글자의 첫글자는 대문자, 뒤에 이어지는 글자는 소문자, 동사형으로 시작
	 * 
	 * !!!!!!!!!!!회사에서 정하는 네이밍 표준이 없을 시 위의 표준을 가져가되 회사에서 정한 네이밍 표준이 존재할 경우 회사의 내규를 우선 따라간다.
	 * 
	 * 
	 */
	
	int maxCount;
	
	public void doSomthing() {
		
	}
	
}
